Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །བརྒྱ་བྱིན་གྱིས་སྨྲས་པ། བཙུན་པ་རབ་འབྱོར་དེ་རྣམ་པ་གང་གིས་ན་དམིགས་པ་མཐའ་ཡས་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་མཐའ་ཡས་པ་སྟེ།
en: Śakra then asked, “Blessed Subhūti, why do you say, ‘This perfection that bodhisattva great beings have is infinite because there is an infinitude of objective referents.

source: འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡིན་ཞེས་སྨྲ།
en: Such is the perfection of wisdom’?” “

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཀཽ་ཤི་ཀ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དམིགས་པ་མཐའ་ཡས་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་མཐའ་ཡས་པ་སྟེ།
en: Kauśika,” replied Subhūti, “this perfection that bodhisattva great beings have is infinite because all-aspect omniscience [and the other attributes, fruits, and realizations] have an infinitude of objective referents.

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་ཆོས་དམིགས་པ་མཐའ་ཡས་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་མཐའ་ཡས་པ་སྟེ།
en: Moreover, Kauśika, this perfection that bodhisattva great beings have is infinite because phenomena have an infinitude of objective referents.

source: །བརྒྱ་བྱིན་གྱིས་སྨྲས་པ། བཙུན་པ་རབ་འབྱོར་དེ་རྣམ་པ་གང་གིས་ན། ཆོས་དམིགས་པ་མཐའ་ཡས་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་མཐའ་ཡས་པ་སྟེ།
en: Śakra then asked, “Blessed Subhūti, why do you say, ‘This perfection that bodhisattva great beings have is infinite because phenomena have an infinitude of objective referents.

source: འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡིན་ཞེས་བྱ།
en: Such is the perfection of wisdom’?” {Ki.

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཀཽ་ཤི་ཀ་ཆོས་ཀྱི་དབྱིངས་མཐའ་ཡས་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་མཐའ་ཡས་པ་སྟེ།
en: II-III: 33} “Kauśika,” replied Subhūti, “this perfection that bodhisattva great beings have is infinite because the realm of phenomena has an infinitude [of objective referents].

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་དེ་བཞིན་ཉིད་དམིགས་པ་མེད་པས་མཐའ་ཡས་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་མཐའ་ཡས་པ་སྟེ།
en: Moreover, Kauśika, this perfection that bodhisattva great beings have is infinite because the real nature has an infinitude of objective referents.

source: དེ་ནི་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ།།
en: Such is the perfection of wisdom.”

source: བརྒྱ་བྱིན་གྱིས་སྨྲས་པ། བཙུན་པ་རབ་འབྱོར་དེ་རྣམ་པ་གང་གིས་ན་དམིགས་པ་མཐའ་ཡས་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་མཐའ་ཡས་པ་སྟེ།
en: Śakra then asked, “Blessed Subhūti, why do you say, ‘This perfection that bodhisattva great beings have is infinite because there is an infinitude of objective referents.

source: འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡིན་ཞེས་བྱ། རབ་འབྱོར་གྱིས་སྨྲས་པ།
en: Such is the perfection of wisdom’?” “

source: ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་དེ་བཞིན་ཉིད་མཐའ་ཡས་པའི་ཕྱིར་དམིགས་པ་མཐའ་ཡས་སོ།
en: Kauśika,” replied Subhūti, “there is an infinitude of objective referents because the real nature is infinite.

source: །དམིགས་པ་མཐའ་ཡས་པའི་ཕྱིར་དེ་བཞིན་ཉིད་མཐའ་ཡས་སོ།
en: The real nature is infinite because there is an infinitude of objective referents.

source: །ཀཽ་ཤི་ཀ་དེ་བཞིན་ཉིད་དང་། དམིགས་པ་མཐའ་ཡས་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་མཐའ་ཡས་སོ།
en: Kauśika, this perfection that bodhisattva great beings have is infinite because the real nature has an infinitude of objective referents. “

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་སེམས་ཅན་མཐའ་ཡས་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་མཐའ་ཡས་སོ།
en: Moreover, Kauśika, this perfection that bodhisattva great beings have is infinite because beings are infinite.”

source: །བརྒྱ་བྱིན་གྱིས་སྨྲས་པ། བཙུན་པ་རབ་འབྱོར་དེ་རྣམ་པ་གང་གིས་ན། སེམས་ཅན་ཅན་མཐའ་ཡས་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་མཐའ་ཡས་པ་ཡིན་ཞེས་བྱ། རབ་འབྱོར་གྱིས་སྨྲས་པ།
en: Śakra asked, “Blessed Subhūti, why do you say, ‘This perfection that bodhisattva great beings have is infinite because beings are infinite’?”

source: ཀཽ་ཤི་ཀ་དེ་ཇི་སྙམ་དུ་སེམས། འདི་ལྟ་སྟེ་སེམས་ཅན་སེམས་ཅན་ཞེས་བྱ་བ་དེ་ཆོས་གང་གི་ཚིག་བླ་དགས་ཡིན།
en: Subhūti asked in return, “Kauśika, do you think that the term being designates something?” “

source: བརྒྱ་བྱིན་གྱིས་སྨྲས་པ། བཙུན་པ་རབ་འབྱོར་དེ་ནི་ཆོས་ཀྱི་ཚིག་བླ་དགས་ཀྱང་མ་ཡིན། ཆོས་མ་ཡིན་པའི་ཚིག་བླ་དགས་ཀྱང་མ་ཡིན་ཏེ།
en: Blessed Subhūti,” replied Śakra, “it is neither the designation of anything nor is it the designation of nothing.

source: འདི་ལྟར་སེམས་ཅན་སེམས་ཅན་ཞེས་བྱ་བ་འདི་ནི་བློ་བུར་དུ་མིང་དུ་བཏགས་པ། དངོས་པོ་མེད་པར་མིང་དུ་བཏགས་པ། དམིགས་པ་མེད་པར་མིང་དུ་བཏགས་པའོ།
en: This being the case, the term being is an appellation that is appended adventitiously, appended to nonentities, and appended without objective referent.”

source: །རབ་འབྱོར་གྱིས་སྨྲས་པ། ཀཽ་ཤི་ཀ་དེ་ཇི་སྙམ་དུ་སེམས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལས་སེམས་ཅན་དུ་བཤད་པ་གང་ཡང་ཡོད་དམ། བརྒྱ་བྱིན་གྱིས་སྨྲས་པ།
en: Subhūti then asked, “Kauśika, do you think that in this perfection of wisdom there is anything that is explained as a ‘being’?” “

source: བཙུན་པ་རབ་འབྱོར་དེ་ནི་མེད་དོ།
en: No, venerable Subhūti!”

source: ཀཽ་ཤི་ཀ་གང་ལ་སེམས་ཅན་དུ་བཤད་པ་གང་ཡང་མེད་པ་དེ་ལ། སེམས་ཅན་མཐའ་ཡས་པ་ཡོད་དེ།
en: Kauśika,” said Subhūti, “beings are infinite in this context where nothing at all is explained as a ‘being.’

source: ཀཽ་ཤི་ཀ་གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་བཞུགས་ཏེ། སེམས་ཅན་སེམས་ཅན་ཞེས་གསུང་དུ་བརྗོད་ན། ཀཽ་ཤི་ཀ་དེ་ཇི་སྙམ་དུ་སེམས། དེ་ལ་སེམས་ཅན་གང་ཡང་སྐྱེ་བའམ། འགག་པར་འགྱུར་བ་ཡོད་དམ།
en: Kauśika, if the tathāgatas, arhats, completely awakened buddhas, present in eons as numerous as the grains of sand of the river Gaṅgā, were to speak of ‘beings,’ do you think, Kauśika, that any being would arise or cease?” “

source: སྨྲས་པ་བཙུན་པ་རབ་འབྱོར་དེ་ནི་མེད་དེ།
en: No, venerable Subhūti!” replied Śakra. “

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། སེམས་ཅན་ཐོག་མ་ནས་རྣམ་པར་དག་པའི་ཕྱིར་རོ།
en: If you ask why, it is because beings are pure from the beginning.”

source: །རབ་འབྱོར་གྱིས་སྨྲས་པ། ཀཽ་ཤི་ཀ་དེ་ལྟར་རྣམ་གྲངས་དེས་ན། སེམས་ཅན་མཐའ་ཡས་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མཐའ་ཡས་པར་རིག་པར་བྱའོ།
en: Subhūti then said, “Kauśika, this formulation explains how one should know that the perfection of wisdom is infinite because beings are infinite.

source: །དེ་ནས་དབང་པོ་དང་བཅས་པའི་ལྷ་རྣམས་དང་། ཚངས་པ་དང་བཅས་པའི་ལྷ་རྣམས་དང་། སྐྱེ་དགུའི་བདག་པོ་དང་བཅས་པའི་ལྷ་རྣམས་དང་། སྐྱེས་པ་དང་བུད་མེད་དུ་བཅས་པ་དག་གིས་ལན་གསུམ་དུ་ཆེད་དུ་བརྗོད་པ་ཆེད་དུ་བརྗོད་དེ།
en: ”{Ki.II-III: 34} Then the gods in the entourage of Indra, the gods in the entourage of Brahmā, and the gods in the entourage of Prajāpati, along with many men and women, made the following pronouncement three times: “Ah!

source: གང་གནས་བརྟན་རབ་འབྱོར་གྱིས་འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་འབྱུང་བའི་དོན་དུ། དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱིས་བརླབས་པ་དང་། མཐུས་བཤད་ཅིང་བརྗོད་པ་བསྟན་པའི་ཆོས་འདི་ནི་ཀྱེ་མ་ལེགས་པར་བཤད་དོ།
en: This Dharma that the elder Subhūti has explained, expressed, and revealed through the blessing of the tathāgatas and through the power of the tathāgatas, in order that the tathāgatas might come forth, has been eloquently explained!

source: །ཀྱེ་མ་ཆོས་འདི་ནི་ལེགས་པར་བཤད་དོ།
en: Ah! This Dharma has been eloquently explained.

source: །ཀྱེ་མ་ཆོས་ཀྱི་ཆོས་ཉིད་འདི་ནི་ལེགས་པར་བཤད་དོ།
en: Ah! This reality of the Dharma has been eloquently explained! “

source: །བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་དང་མ་བྲལ་བ་དེ་ནི། དེ་བཞིན་གཤེགས་པ་ཉིད་དུ་གཟུང་བར་བགྱིའོ། །ཆོས་གང་ཡང་དམིགས་སུ་མ་མཆིས་ཏེ། གཟུགས་སམ། ཚོར་བའམ།
en: Blessed Lord, we shall uphold as the very tathāgata those bodhisattva great beings who are not separated from this perfection of wisdom.

source: འདུ་ཤེས་སམ། འདུ་བྱེད་དམ། རྣམ་པར་ཤེས་པའམ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་རམ། ཆོས་གང་ཡང་དམིགས་སུ་མ་མཆིས་ཀྱིས་ཀྱང་ཐེག་པ་གསུམ་རྣམ་པར་དགོད་པ་མཆིས་ཏེ། གསུམ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་དང་།
en: Although nothing at all is apprehensible—for physical forms, feelings, perceptions, formative predispositions, consciousness, and everything else, up to and including all-aspect omniscience, are all nonapprehensible—three vehicles are nonetheless set forth, that is to say the vehicle of the śrāvakas, the vehicle of the pratyekabuddhas, and the vehicle of the completely awakened buddhas.”

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཐེག་པའོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དབང་པོ་དང་བཅས་པ་རྣམས་ལ་བཀའ་སྩལ་པ། ལྷའི་བུ་དག་དེ་དེ་བཞིན་ནོ།
en: Then the Blessed One said to those gods in the entourage of Indra, “Divine princes, it is so!

source: །ཇི་སྐད་དུ་སྨྲས་པ་དེ་དེ་བཞིན་ཏེ། ཆོས་གང་ཡང་དམིགས་སུ་མེད་དེ། གཟུགས་སམ། ཚོར་བའམ།
en: It is just as you have spoken.

source: འདུ་ཤེས་སམ། འདུ་བྱེད་དམ། རྣམ་པར་ཤེས་པའམ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་རམ། ཆོས་གང་ཡང་མི་དམིགས་མོད་ཀྱི་ཐེག་པ་གསུམ་རྣམ་པར་དགོད་པ་ཡང་ཡོད་དེ། གསུམ་གང་ཞེ་ན། ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་དང་།
en: Although nothing at all is apprehensible—for physical forms, feelings, perceptions, formative predispositions, consciousness, and everything else, up to and including all-aspect omniscience, are indeed all nonapprehensible—there are nonetheless three vehicles set forth, that is to say the vehicle of the śrāvakas, the vehicle of the pratyekabuddhas, and the vehicle of the completely awakened buddhas.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཐེག་པའོ། །ལྷའི་བུ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་མི་དམིགས་པའི་ཚུལ་གྱིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་དང་མ་བྲལ་བ་དེ་ནི། དེ་བཞིན་གཤེགས་པ་ཉིད་དུ་གཟུང་བར་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Divine princes, you should uphold as the very tathāgata those bodhisattva great beings who, by way of not apprehending anything, are not separated from this perfection of wisdom.

source: དེ་ནི་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལས་ཐེག་པ་གསུམ་རྒྱ་ཆེར་བསྟན་ཏེ། གསུམ་གང་ཞེ་ན། འདི་ལྟར་ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་དང་། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཐེག་པ་བཤད་དོ། །ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ལམ་དང་། འཕགས་པའི་བདེན་པ་དང་བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་།
en: If you ask why, it is because from this perfection of wisdom they extensively teach the three vehicles, that is to say, as they explain, the vehicle of the śrāvakas, the vehicle of the pratyekabuddhas, and the vehicle of the completely awakened buddhas. “

source: སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལས་གཞན་དུ་ཡང་དེ་བཞིན་གཤེགས་པ་མི་དམིགས་སོ།
en: A tathāgata is nevertheless not apprehensible as anything other than the perfections, all the aspects of emptiness, the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, the distinct qualities of the buddhas, and [all the fruits and realizations], up to and including all-aspect omniscience. “

source: །ལྷའི་བུ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཆོས་འདི་དག་ཐམས་ཅད་ལ་སློབ་པ་སྟེ།
en: Divine princes, bodhisattva great beings should train in all these attributes.

source: སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སློབ་བོ། །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: That is to say, they should train in the perfection of generosity, and they should train in the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སློབ་བོ། །ནང་སྟོང་པ་ཉིད་ལ་སློབ་བོ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་སློབ་བོ། །དྲན་པ་ཉེ་བར་གཞག་པ་ལ་སློབ་བོ། །ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ལམ་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་།
en: They should train in the emptiness of internal phenomena, and they should train in [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: མི་འཇིགས་པ་དང་།
en: Ki.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་སློབ་བོ། ལྷའི་བུ་དག་དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་དང་མི་འབྲལ་བར། སྤྱོད་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་ཉིད་ཅེས་བྱ་སྟེ།
en: II-III: 35} “Divine princes, it is for that reason that bodhisattva great beings who practice this perfection of wisdom inseparably are said to be tathāgatas.

source: ལྷའི་བུ་དག་གང་གི་ཚེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ཀྱི་ཞབས་འབྲིང་བྱེད་ཅིང་། རྒྱལ་པོའི་ཁབ་པད་མོ་ཡོད་པའི་ནང་གི་ཚོང་འདུས་ཀྱི་དབུས་ན་འདུག་པའི་ཚེ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བྲལ་བར་མ་གྱུར་ཏོ། །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། ལམ་རྣམས་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་།
en: Divine princes, when I attended upon the tathāgata, arhat, completely awakened Buddha Dīpaṃkara, and stood in the middle of the market in the Padmavatī royal court at Rājagṛha, I was not separated from the perfection of generosity.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་དང་ཡང་བྲལ་བར་མ་གྱུར་ཏེ། དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་སངས་རྒྱས་ཀྱི་ཆོས་ཚད་མེད་པ་གཞན་དག་དང་ཡང་བྲལ་བར་མ་གྱུར་ཏོ།
en: Without apprehending anything, I was not separated even from the other immeasurable attributes of the buddhas.

source: །ལྷའི་བུ་དག་དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ཀྱིས། ང་ལ་ཁྱེའུ་ཁྱོད་ནི་མ་འོངས་པའི་དུས་ཀྱི་བསྐལ་པ་གྲངས་མེད་པ་ན། བསྐལ་པ་བཟང་པོའི་ཚེ། འཇིག་རྟེན་གྱི་ཁམས་འདི་ཉིད་དུ་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མཁྱེན་པ་དང་རྐང་པར་ལྡན་པ། བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་མཁྱེན་པ། བླ་ན་མེད་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་སུ་འགྱུར་རོ། །ཞེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏོ། །དེ་ནས་ལྷའི་བུ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Divine princes, at that time, the tathāgata, arhat, completely awakened Buddha Dīpaṃkara prophesied that I would attain unsurpassed, complete enlightenment, saying, “My child, in the future, after countless eons in this world system, during the Auspicious Eon, you will become Śākyamuni, a tathāgata, arhat, completely awakened buddha perfect in wisdom and conduct, a sugata who knows the world, a steersman for living creatures who are to be trained, an unsurpassed teacher of gods and humans.”

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་དེ་ལྟར་གཟུགས་མི་ལེན་མི་འདོར་བའི་ཚུལ་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མི་ལེན་མི་འདོར་བའི་ཚུལ་དང་། སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་མི་ལེན་མི་འདོར་བའི་ཚུལ་གྱིས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་འཐུན་པར་ཡོངས་སུ་འཛིན་པ་ནི་ངོ་མཚར་ཆེའོ།
en: The gods then said to the Blessed One, “Blessed Lord, it is wonderful how the bodhisattva great beings’ perfection of wisdom favorably sustains the bodhisattva great beings’ all-aspect omniscience, without acquiring or relinquishing physical forms; without acquiring or relinquishing feelings, perceptions, formative predispositions, or consciousness; and without acquiring or relinquishing the sense fields, the sensory elements, the links of dependent origination, the perfections, the aspects of emptiness, the factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, the eighteen distinct qualities of the buddhas, or [any of the fruits and realizations], up to and including all-aspect omniscience.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་དང་དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མའི་འཁོར་བཞི་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷའི་བུ་དང་། འོག་མིན་གྱི་བར་གྱི་ལྷའི་བུ་དེ་དག་འདུས་ཤིང་ཚོགས་པར་མཁྱེན་ནས།
en: Then the Blessed One, knowing that all four assemblies of monks, nuns, laymen, and laywomen were gathered and present, along with the bodhisattva great beings, the gods of the Caturmahā­rāja­kāyika realm, and the assembled gods of all other realms, up to and including Akaniṣṭha, {Ki.

source: དེ་དག་ཐམས་ཅད་དཔང་དུ་བཅུགས་ཏེ། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའམ། དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་འམ། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོའམ། ལྷའི་བུའམ་ལྷའི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། སྒོམ་པ་དང་། གཞན་ལ་རྒྱ་ཆེར་འཆད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་ཅིང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་དང་ཡང་མི་འབྲལ་བ་དེ་དག་ནི། བདུད་སྡིག་ཏོ་ཅན་དང་། བདུད་ཀྱི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱིས་གླགས་རྙེད་པར་མི་འགྱུར་རོ།
en: II-III 36} established them all as witnesses, and addressed Śakra, mighty lord of the gods: “Kauśika, evil Māra and the gods of the māras’ realm will find no opportunity to inflict harm on those bodhisattva great beings or monks, nuns, laymen, laywomen, noble sons, noble daughters, gods, or goddesses who take up, uphold, recite, master, cultivate, extensively explain to others, and focus their attention correctly on this perfection of wisdom and are never separated from the mind set on all-aspect omniscience.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་གཟུགས་སྟོང་པ་ཉིད་ཤིན་དུ་བྱིན་གྱིས་བརླབས་པར་འགྱུར། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྟོང་པ་ཉིད་ཤིན་དུ་བྱིན་གྱིས་བརླབས་པར་འགྱུར་རོ།
en: If you ask why, it is because these noble sons and noble daughters will have been totally consecrated in [the understanding] that physical forms are emptiness, and similarly they will have been totally consecrated in [the understanding] that feelings, perceptions, formative predispositions, and consciousness are emptiness.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་སྟོང་པ་ཉིད་ཀྱིས་སྟོང་པ་ཉིད་ལ་གླགས་མི་རྙེད།
en: If you ask why, it is because there is no opportunity for emptiness to impinge upon emptiness.

source: མཚན་མ་མེད་པས་མཚན་མ་མེད་པ་ལ་གླགས་མི་རྙེད།
en: There is no opportunity for signlessness to impinge upon signlessness.

source: སྨོན་པ་མེད་པས་སྨོན་པ་མེད་པ་ལ་གླགས་མི་རྙེད་དོ། །དེ་ནི་འདི་ལྟར་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་།
en: There is no opportunity for wishlessness to impinge upon wishlessness. “

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་སྟོང་པ་ཉིད་ཤིན་དུ་བྱིན་གྱིས་བརླབས་པར་འགྱུར་རོ།
en: In the same way, these noble sons and noble daughters will have been totally consecrated in [the understanding] that the sense fields, the sensory elements, the links of dependent origination, the perfections, all the aspects of emptiness, the factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, the eighteen distinct qualities of the buddhas, and [all the fruits and realizations], up to and including all-aspect omniscience, are emptiness.

source: སྨོན་པ་མེད་པས་སྨོན་པ་མེད་པ་ལ་གླགས་མི་རྙེད་དོ།
en: There is no opportunity for wishlessness to impinge upon wishlessness.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་གང་གིས་གླགས་རྙེད་པར་འགྱུར་བ་དང་། གང་དུ་གླགས་རྙེད་པར་འགྱུར་བ་དང་། གང་ལ་གླགས་རྙེད་པར་འགྱུར་བ་དེ་དག་གིས་ངོ་བོ་ཉིད་མེད་དོ།
en: If you ask why, it is because that which would find an opportunity to impinge upon them, the situation in which it would find an opportunity to impinge, and that upon which it would find an opportunity to impinge are all without inherent existence. “

source: །ཀཽ་ཤི་ཀ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་ལ་ནི་མིའམ། མི་མ་ཡིན་པ་གླགས་ལྟ་ཞིང་གླགས་ཚོལ་བ་དག་གིས་གླགས་རྙེད་པར་མི་འགྱུར་རོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Kauśika, humans or nonhumans who would look for and seek an opportunity to impinge upon those noble sons or noble daughters will not find an opportunity to impinge.

source: དེ་ནི་འདི་ལྟར་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས། སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པ་དང་། སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་ཤིན་དུ་བསྒོམས་པའི་ཕྱིར་རོ།
en: If you ask why, Kauśika, it is because these noble sons and noble daughters fully cultivate loving kindness, compassion, empathetic joy, and equanimity toward all beings, by way of not apprehending anything. {

source: །རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི་ཉམ་ང་བ་མི་སྤོངས་པས་དུས་བྱེད་པར་ཡང་མི་འགྱུར་ཏེ།
en: Ki.II-III: 37} It will not happen that those noble sons and noble daughters fail to avoid any misfortunes that might have caused them untimely death.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དེ་དག་གིས། སེམས་ཅན་ཐམས་ཅད་ལ་ཡང་དག་པའི་རིམ་གྲོས་བསྙེན་བཀུར་བྱས་པའི་ཕྱིར་རོ། །ཀཽ་ཤི་ཀ་གང་ཡང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་དང་། སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་དང་། མཚེ་མ་དང་དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་།
en: If you ask why, it is because noble sons and noble daughters who practice the perfection of generosity respect all beings with genuine acts of service. “
